# 자료형

# 정수형
a = 3
b = -3
c = 0
print("-------------정수형-------------")
print(a)
print(b)
print(c)
print("--------------------------------")
# 실수형
a = 148.89
b = -148.89
c = 5. # 소수부가 0일 때 0은 생략
d = -.7 # 정수부가 0일 때 0은 생략
print("-------------실수형-------------")
print(a)
print(b)
print(c)
print(d)
print("--------------------------------")


# 사칙연산
a = 5
b = 3
print("-------------사칙연산-----------")
print(a + b)
print(a - b)
print(a // b) # 몫
print(a / b) # 나누기
print(a % b)
print(a * b)
print(a ** b) #거듭제곱 연산자
print("--------------------------------")
# round() 함수
print("-------------round함수-----------")
a = 0.3 + 0.6
print(a)

a = 0.3 + 0.6
print(round(a, 4)) # 소수 다섯 번째 자리에서 반올림
print("--------------------------------")